tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Gatsby command-line interface
brew "gatsby-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# Web and API based SMTP testing tool
brew "mailhog"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node@14"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql", restart_service: true
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Version control system designed to be a better CVS
brew "subversion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Two-factor authentication software
cask "authy"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Cryptocurrency exchange
cask "binance"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Downloads videos and audio from websites
cask "clipgrab"
# Full-featured desktop app for DevDocs.io
cask "devdocs"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-space-mono-nerd-font"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualizer
cask "keycastr"
# Detailed information on every Apple product ever made
cask "mactracker"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# Digital design and prototyping platform
cask "sketch"
# Graphical client for Git version control
cask "sourcetree"
# Text editor for code, markup and prose
cask "sublime-text"
# CSV file editor
cask "table-tool"
# Messaging app with a focus on speed and security
cask "telegram"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Trading platform
cask "tiger-trade"
# Git client focusing on power and productivity
cask "tower"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "ColorSlurp", id: 1287239339
mas "Day One", id: 1055511498
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "MindNode", id: 1289197285
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Screenie", id: 965442961
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "Xcode", id: 497799835
