tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# C Foreign Function Interface for Python
brew "cffi", link: false
# Cryptographic recipes and primitives for Python
brew "cryptography"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line tool for DigitalOcean
brew "doctl"
# Text processing system for reStructuredText
brew "docutils"
# Modern replacement for 'ls'
brew "exa"
# Asynchronous event library
brew "libevent"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Gatsby command-line interface
brew "gatsby-cli"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Image manipulation library
brew "jpeg", link: true
# Easy way to access the system keyring service from python
brew "keyring"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql", restart_service: true
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Platform built on V8 to build network applications
brew "node@14"
# Platform built on V8 to build network applications
brew "node@16"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15", restart_service: true
# Python version management
brew "pyenv"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Version control system designed to be a better CVS
brew "subversion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Cryptocurrency exchange
cask "binance"
# E-books management software
cask "calibre"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-geist"
cask "font-geist-mono"
cask "font-sf-mono"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualiser
cask "keycastr"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Word processor
cask "microsoft-word"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# Comic viewer/reader
cask "simple-comic"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# CSV file editor
cask "table-tool"
# Messaging app with a focus on speed and security
cask "telegram"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Trading platform
cask "tiger-trade"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Day One", id: 1055511498
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "mymind", id: 1532801185
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Screenie", id: 965442961
mas "Spark", id: 1176895641
mas "Spark Desktop", id: 6445813049
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Wireless@SGx", id: 1449928544
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.vscode-mysql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enhancedjax.vscode-ayu-zed"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "jasonnutter.search-node-modules"
vscode "juanblanco.solidity"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "nascc.gptheme-plus"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "remixproject.ethereum-remix"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
